const Category = [
  {
    category_id: 1,
    name: 'Декоративный кирпич Дижон 787',
    title:
      'Декоративный кирпич «Дижон 787» передаст особое очарование старых кирпичных домов, покрытых «благородной городской патиной».',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'brick-1.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Орли 403',
    title: 'Ригельный кирпич «Сиэтл 403 mix» подойдет любителям брутальных оттенков.',
    price: '2200 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Орли 403.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Орли 465',
    title:
      '«Орли 465» передаёт дух старины благодаря состаренной фактуре и хаотичным трещинам.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Орли 465.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Париж-2 052',
    title:
      '«Париж-2 052» – идеальный вариант для тех, кто хочет создать лофтовое настроение.',
    price: '1650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Париж-2 052.jpg',
  },
  {
    category_id: 1,
    name: 'Искусственный камень Монако 464',
    title:
      'Благодаря искусственному камню «Монако 464» ваш дом будет выглядеть эффектно и респектабельно.',
    price: '1900 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Искусственный камень Монако 464.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Роттердам 707',
    title: 'Ригельный кирпич «Роттердам 707» добавит характер и стиль вашему интерьеру.',
    price: '2350 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Ригельный кирпич Роттердам 707.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Роттердам 709',
    title: 'Ригельный кирпич «Роттердам 709» добавит характер и стиль вашему интерьеру.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'Ригельный кирпич Роттердам 709.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Сиэтл 403 mix',
    title: 'Ригельный кирпич «Сиэтл 403 mix» подойдет любителям брутальных оттенков.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'Ригельный кирпич Сиэтл 403 mix.jpg',
  },
  // ==================================================================================
  {
    category_id: 1,
    name: 'Коллекция AMBASSADOR',
    title:
      'Абстрактные рисунки, вдохновлённые текстурой камня и текучестью природных минералов, стали основой новой коллекции AMBASSADOR от Victoria Stenova.',
    price: '3000 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 1.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция ANDORRA',
    title:
      'Коллекция ANDORRA – это не просто обои, это шикарная фактура с плавными завораживающими формами, которая создаст в вашем доме неповторимую атмосферу уюта и элегантности.',
    price: '2950 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 2.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция APULIA',
    title:
      'Мрамор остаётся в числе главных трендов в дизайне, и в коллекции APULIA от Victoria Stenova он предстаёт в своём естественном, драматичном облике.',
    price: '2800 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 3.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция BELLAGIO',
    title:
      'Эти уникальные обои прекрасно передают текстуру и глубину классической итальянской штукатурки, создавая роскошный и, одновременно, теплый интерьер.',
    price: '2600 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 4.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция BIOTREND',
    title:
      'Коллекция обоев BIOTREND приносит природу в интерьер с лёгкостью и изяществом. Крупные листья, прорисованные тонкими линиями, с эффектом полупрозрачности наполняют пространство свежестью и гармонией.',
    price: '2400 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 5.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция BLESK',
    title:
      'BLESK вобрал в себя последние интерьерные тренды: металл, глянец, текстуру с «мятым» эффектом, дерзкие контрасты и игру света.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 6.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция CONNECT',
    title:
      'Коллекция обоев CONNECT от Victoria Stenova Exclusive — это синтез модной палитры и точной геометрии.  Это графика, стиль и ритм современного интерьера.  Это гармония геометрии и текстиля.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 7.jpg',
  },
  {
    category_id: 1,
    name: 'Коллекция LINKRUSTA',
    title:
      'Для смелых акцентов предлагаются три ярких дуэта: белые цветы на солнечном жёлтом фоне, серо-фиолетовое серебро на трендовом терракотовом цвете и контрастные белые цветы на темно-сером фоне.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 8.jpg',
  },
  // ===================================================================================
  {
    category_id: 2,
    name: 'Керамогранит MDetails High Glossy Alexa Black',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: High Glossy. Имеет глянцевую (полированную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат).',
    price: '5832 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 1.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails High Glossy Bernardo Black',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: High Glossy. Имеет глянцевую (полированную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат).',
    price: '5900 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 2.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails High Glossy Black River',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: High Glossy. Имеет глянцевую (полированную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат).',
    price: '5700 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 3.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails High Glossy Dazzle Onyx Black',
    title:
      'Представляем вашему вниманию плитку MDetails High Glossy Dazzle Onyx Black размером 60×120 см, произведенную в Индии. Этот продукт является отличным выбором для тех, кто стремится создать в своем доме атмосферу роскоши и блеска.',
    price: '5750 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 4.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails High Glossy Emperador Brown',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: High Glossy. Имеет глянцевую (полированную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат).',
    price: '5650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 5.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails Marble Amato White Glossy',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: Marble. Имеет глянцевую (полированную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат)..',
    price: '5600 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 6.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails Marble Patagonia Matt ',
    title:
      'Представляем вашему вниманию плитку MDetails Marble Patagonia Matt размером 60×120 см, произведенную в Индии. Эта керамогранитная плитка является идеальным решением для тех, кто ценит в интерьере роскошь натурального мрамора, но предпочитает практичность и долговечность современных материалов.',
    price: '5790 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 7.jpg',
  },
  {
    category_id: 2,
    name: 'Керамогранит MDetails Marble Venus White Matt',
    title:
      'Универсальная плитка,Напольная плитка,Настенная плитка из керамогранита от Индийского производителя: MDetails, коллекция: Marble. Имеет матовую (натуральную) поверхность, изготовлено в форме прямоугольника имеет обрезные края (ректификат). ',
    price: '5790 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'плитка 8.jpg',
  },
  // =========================================================================
  {
    category_id: 3,
    name: 'Шёлковый лён',
    title:
      'Матовая поверхность с лёгкой тканевой текстурой, мягко рассеивает свет, создаёт уют.',
    price: '4300 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 1.jpg',
  },
  {
    category_id: 3,
    name: 'Белый сатин',
    title:
      'Полуматовая гладкая поверхность с нежным перламутровым блеском, визуально поднимает потолок.',
    price: '4500 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 2.jpg',
  },
  {
    category_id: 3,
    name: 'Облачный шифон',
    title:
      'Натяжной потолок с едва заметной полупрозрачной текстурой, как лёгкие облака, идеален с подсветкой.',
    price: '4700 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 3.jpg',
  },
  {
    category_id: 3,
    name: 'Тёмный бетонс',
    title:
      'Глубокий серый матовый потолок с эффектом шлифованного бетона — для лофта и минимализма.',
    price: '4400 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 4.jpg',
  },
  {
    category_id: 3,
    name: 'Зеркальный хромс',
    title:
      'Глянцевый металлизированный потолок, отражает свет и пространство почти как зеркало.',
    price: '4300 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 5.jpg',
  },
  {
    category_id: 3,
    name: 'Снежный мрамор',
    title:
      'Белая поверхность с тонкими серыми прожилками под натуральный мрамор, выглядит дорого и спокойно.',
    price: '4800 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 6.jpg',
  },
  {
    category_id: 3,
    name: 'Ночное небо',
    title:
      'Глубокий тёмно-синий или чёрный глянец с встроенными точечными светильниками-«звёздами».',
    price: '5000 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 7.jpg',
  },
  {
    category_id: 3,
    name: 'Деревянные рейки',
    title:
      'Реечный потолок из натурального шпона или крашеного МДФ (тёплый дуб, орех или белый) — тренд 2025–2026.',
    price: '4800 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'потолок 8.jpg',
  },
];

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface) {
    await queryInterface.bulkInsert('Materials', Category, {});
  },

  async down(queryInterface) {
    await queryInterface.bulkDelete('Materials', null, {});
  },
};
