const Category = [
  // {
  //   category_id: 1,
  //   name: 'Декоративный кирпич Орли 465',
  //   title:
  //     '«Орли 465» передаёт дух старины благодаря состаренной фактуре и хаотичным трещинам.',
  //   price: '1700 руб./м2',
  //   // unit_m2: 0,
  //   is_popular: false,
  //   img: 'Декоративный кирпич Орли 465.jpg',
  // },
  {
    category_id: 1,
    name: 'Декоративный кирпич Дижон 787',
    title:
      'Декоративный кирпич «Дижон 787» передаст особое очарование старых кирпичных домов, покрытых «благородной городской патиной».',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'Декоративный кирпич Дижон 787.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Орли 403',
    title: 'Ригельный кирпич «Сиэтл 403 mix» подойдет любителям брутальных оттенков.',
    price: '2200 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Орли 403.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Орли 465',
    title:
      '«Орли 465» передаёт дух старины благодаря состаренной фактуре и хаотичным трещинам.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Орли 465.jpg',
  },
  {
    category_id: 1,
    name: 'Декоративный кирпич Париж-2 052',
    title:
      '«Париж-2 052» – идеальный вариант для тех, кто хочет создать лофтовое настроение.',
    price: '1650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Декоративный кирпич Париж-2 052.jpg',
  },
  {
    category_id: 1,
    name: 'Искусственный камень Монако 464',
    title:
      'Благодаря искусственному камню «Монако 464» ваш дом будет выглядеть эффектно и респектабельно.',
    price: '1900 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Искусственный камень Монако 464.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Роттердам 707',
    title: 'Ригельный кирпич «Роттердам 707» добавит характер и стиль вашему интерьеру.',
    price: '2350 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'Ригельный кирпич Роттердам 707.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Роттердам 709',
    title: 'Ригельный кирпич «Роттердам 709» добавит характер и стиль вашему интерьеру.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'Ригельный кирпич Роттердам 709.jpg',
  },
  {
    category_id: 1,
    name: 'Ригельный кирпич Сиэтл 403 mix',
    title: 'Ригельный кирпич «Сиэтл 403 mix» подойдет любителям брутальных оттенков.',
    price: '1600 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'Ригельный кирпич Сиэтл 403 mix.jpg',
  },
  // ==================================================================================
  {
    category_id: 2,
    name: 'Коллекция AMBASSADOR',
    title:
      'Абстрактные рисунки, вдохновлённые текстурой камня и текучестью природных минералов, стали основой новой коллекции AMBASSADOR от Victoria Stenova.',
    price: '3000 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 1.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция ANDORRA',
    title:
      'Коллекция ANDORRA – это не просто обои, это шикарная фактура с плавными завораживающими формами, которая создаст в вашем доме неповторимую атмосферу уюта и элегантности.',
    price: '2950 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 2.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция APULIA',
    title:
      'Мрамор остаётся в числе главных трендов в дизайне, и в коллекции APULIA от Victoria Stenova он предстаёт в своём естественном, драматичном облике.',
    price: '2800 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 3.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция BELLAGIO',
    title:
      'Эти уникальные обои прекрасно передают текстуру и глубину классической итальянской штукатурки, создавая роскошный и, одновременно, теплый интерьер.',
    price: '2600 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 4.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция BIOTREND',
    title:
      'Коллекция обоев BIOTREND приносит природу в интерьер с лёгкостью и изяществом. Крупные листья, прорисованные тонкими линиями, с эффектом полупрозрачности наполняют пространство свежестью и гармонией.',
    price: '2400 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 5.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция BLESK',
    title:
      'BLESK вобрал в себя последние интерьерные тренды: металл, глянец, текстуру с «мятым» эффектом, дерзкие контрасты и игру света.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: false,
    img: 'обои 6.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция CONNECT',
    title:
      'Коллекция обоев CONNECT от Victoria Stenova Exclusive — это синтез модной палитры и точной геометрии.  Это графика, стиль и ритм современного интерьера.  Это гармония геометрии и текстиля.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 7.jpg',
  },
  {
    category_id: 2,
    name: 'Коллекция LINKRUSTA',
    title:
      'Для смелых акцентов предлагаются три ярких дуэта: белые цветы на солнечном жёлтом фоне, серо-фиолетовое серебро на трендовом терракотовом цвете и контрастные белые цветы на темно-сером фоне.',
    price: '2650 руб./м2',
    // unit_m2: 0,
    is_popular: true,
    img: 'обои 8.jpg',
  },
  // ===================================================================================

];

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface) {
    await queryInterface.bulkInsert('Materials', Category, {});
  },

  async down(queryInterface) {
    await queryInterface.bulkDelete('Materials', null, {});
  },
};
